Adding / Removing Columns

In [17]:
import pandas as pd
import numpy as np

In [18]:
coffee = pd.read_csv('data/warmup-data/coffee.csv')

In [19]:
coffee['price'] = 4.99

In [20]:
coffee.head()

         Day Coffee Type  Units Sold  price
0     Monday    Espresso          25   4.99
1     Monday       Latte          15   4.99
2    Tuesday    Espresso          30   4.99
3    Tuesday       Latte          20   4.99
4  Wednesday    Espresso          35   4.99

In [21]:
coffee['new_price'] = np.where(coffee["Coffee Type"]=='expresso', 3.99, 5.99)

In [22]:
coffee

          Day Coffee Type  Units Sold  price  new_price
0      Monday    Espresso          25   4.99       5.99
1      Monday       Latte          15   4.99       5.99
2     Tuesday    Espresso          30   4.99       5.99
3     Tuesday       Latte          20   4.99       5.99
4   Wednesday    Espresso          35   4.99       5.99
5   Wednesday       Latte          25   4.99       5.99
6    Thursday    Espresso          40   4.99       5.99
7    Thursday       Latte          30   4.99       5.99
8      Friday    Espresso          45   4.99       5.99
9      Friday       Latte          35   4.99       5.99
10   Saturday    Espresso          45   4.99       5.99
11   Saturday       Latte          35   4.99       5.99
12     Sunday    Espresso          45   4.99       5.99
13     Sunday       Latte          35   4.99       5.99

In [23]:
coffee_new = coffee.copy()
coffee_new.iloc[1,2] = 'somto'
coffee_new

/tmp/ipykernel_62206/260128925.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'somto' has dtype incompatible with int64, please explicitly cast to a compatible dtype first.
  coffee_new.iloc[1,2] = 'somto'

          Day Coffee Type Units Sold  price  new_price
0      Monday    Espresso         25   4.99       5.99
1      Monday       Latte      somto   4.99       5.99
2     Tuesday    Espresso         30   4.99       5.99
3     Tuesday       Latte         20   4.99       5.99
4   Wednesday    Espresso         35   4.99       5.99
5   Wednesday       Latte         25   4.99       5.99
6    Thursday    Espresso         40   4.99       5.99
7    Thursday       Latte         30   4.99       5.99
8      Friday    Espresso         45   4.99       5.99
9      Friday       Latte         35   4.99       5.99
10   Saturday    Espresso         45   4.99       5.99
11   Saturday       Latte         35   4.99       5.99
12     Sunday    Espresso         45   4.99       5.99
13     Sunday       Latte         35   4.99       5.99

In [24]:
#coffee.drop(columns=['price'], inplace= True)
coffee = coffee.drop(columns=['price'])# to Drop the columns this would have also work
#coffee = coffee(['day', 'Coffee Type', 'Units Sold', 'new_price'])

In [25]:
coffee

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       5.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       5.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       5.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       5.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       5.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          45       5.99
11   Saturday       Latte          35       5.99
12     Sunday    Espresso          45       5.99
13     Sunday       Latte          35       5.99

In [26]:
coffee['revenue'] = coffee['Units Sold'] * coffee['new_price']

In [27]:
coffee.head()

         Day Coffee Type  Units Sold  new_price  revenue
0     Monday    Espresso          25       5.99   149.75
1     Monday       Latte          15       5.99    89.85
2    Tuesday    Espresso          30       5.99   179.70
3    Tuesday       Latte          20       5.99   119.80
4  Wednesday    Espresso          35       5.99   209.65

In [28]:
coffee.rename(columns={"new_price": "price"}, inplace=True)#using inplace makes is permanent
#coffee = coffee.copy()
coffee.head()

         Day Coffee Type  Units Sold  price  revenue
0     Monday    Espresso          25   5.99   149.75
1     Monday       Latte          15   5.99    89.85
2    Tuesday    Espresso          30   5.99   179.70
3    Tuesday       Latte          20   5.99   119.80
4  Wednesday    Espresso          35   5.99   209.65

In [29]:
coffee.head(0)

Empty DataFrame
Columns: [Day, Coffee Type, Units Sold, price, revenue]
Index: []

In [30]:
bios = pd.read_csv('data/bios.csv')
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [31]:
"""
Trying to get specific data fromt he group 
This scenario it will be the to get a specific name from the dataset
"""
bios_new = bios.copy()# make a copy of the dataset to a new variable in order not to alter it
"""
This puts a space [' '] between the strings in the 'name' column
then prints them into the new column  'first_name' 
also identifying wish string you want by index
"""
bios_new['first_name'] = bios_new['name'].str.split(' ').str[0]

In [32]:
bios_new.query('first_name == "Keith"')# query used to find specific in column data (strings)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,first_name
1897,1907,Keith Hanlon,1966-09-01,NaN,NaN,NaN,Ireland,NaN,NaN,NaN,Keith
3505,3517,Keith Wallace,1961-03-29,Preston,England,GBR,Great Britain,165.0,51.0,1999-12-31,Keith
6228,6255,Keith Hartley,1940-10-15,Vancouver,British Columbia,CAN,Canada,200.0,85.0,NaN,Keith
8898,8946,Keith Mwila,1966-01-01,NaN,NaN,NaN,Zambia,NaN,NaN,1993-01-09,Keith
12053,12118,Keith Hervey,1898-11-03,Fulham,England,GBR,Great Britain,NaN,NaN,1973-02-22,Keith
...,...,...,...,...,...,...,...,...,...,...,...
99921,100722,Keith Carney,1970-02-03,Providence,Rhode Island,USA,United States,188.0,93.0,NaN,Keith
102227,103168,Keith Beavers,1983-02-09,London,Ontario,CAN,Canada,185.0,75.0,NaN,Keith
109900,111105,Keith Cumberpatch,1927-08-25,Christchurch,Canterbury,NZL,New Zealand,NaN,NaN,2013-11-15,Keith
115973,117348,Keith Sanderson,1975-02-02,Plymouth,Massachusetts,USA,United States,183.0,95.0,NaN,Keith
122121,124176,Keith Ferguson,1979-09-07,Sale,Victoria,AUS,Australia,176.0,78.0,NaN,Keith

In [33]:
"""
trying to get specific data from a group
this time the first year from the born_date column
"""
bios_new['born_datetime'] = pd.to_datetime(bios_new['born_date'], errors='coerce')# format=&Y-%M-%d

In [34]:
bios_new.info()
bios_new['born_year']=bios_new['born_datetime'].dt.year
bios_new[['name', 'born_year']]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 12 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   athlete_id     145500 non-null  int64
 1   name           145500 non-null  object
 2   born_date      143693 non-null  object
 3   born_city      110908 non-null  object
 4   born_region    110908 non-null  object
 5   born_country   110908 non-null  object
 6   NOC            145499 non-null  object
 7   height_cm      106651 non-null  float64
 8   weight_kg      102070 non-null  float64
 9   died_date      33940 non-null   object
 10  first_name     145500 non-null  object
 11  born_datetime  143693 non-null  datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(1), object(8)
memory usage: 13.3+ MB

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

In [35]:
bios_new.to_csv('./data/bios_new.csv', index=False)

"""
### Adding custom data to our dataset
"""

In [36]:
bios['height_category'] = bios['height_cm'].apply(lambda x: 'Short' if x < 165 else ('average' if x < 185 else 'Tall'))
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall
...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,average
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,average
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,Short
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,average
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,Tall

In [37]:
def categorize_athelete(row):
    if row['height_cm'] < 175 and row['weight_kg'] < 70:
        return 'LightWeight'
    elif row['height_cm'] > 175 and row['weight_kg'] > 70:
        return 'HeightWeight'
    else:
        return 'HeavyWeight'
    
bios['Category'] = bios.apply(categorize_athelete, axis=1)

In [38]:
bios.head(20)

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,height_category,Category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,Tall,HeavyWeight
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,average,HeightWeight
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,average,HeightWeight
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,average,LightWeight
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,Tall,HeavyWeight
5,6,Nicolas Chatelain,1970-01-13,Amiens,Somme,FRA,France,181.0,70.0,NaN,average,HeavyWeight
6,7,Patrick Chila,1969-11-27,Ris-Orangis,Essonne,FRA,France,180.0,73.0,NaN,average,HeightWeight
7,8,Henri Cochet,1901-12-14,Villeurbanne,Rhône,FRA,France,NaN,NaN,1987-04-02,Tall,HeavyWeight
8,9,Marcel Cousin,1896-08-04,Nîmes,Gard,FRA,France,NaN,NaN,1986-08-01,Tall,HeavyWeight
9,10,Guy de la Chapelle,1868-07-16,Farges-Allichamps,Cher,FRA,France,NaN,NaN,1923-08-27,Tall,HeavyWeight
10,11,"Élie, Comte de Lastours",1874-08-12,Orgeval,Yvelines,FRA,France,NaN,NaN,1932-11-18,Tall,HeavyWeight
11,12,Max Decugis,1882-09-24,Paris XVIe,Paris,FRA,France,NaN,NaN,1978-09-06,Tall,HeavyWeight
12,13,J. Defert,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,Tall,HeavyWeight
13,14,Étienne Durand,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN,Tall,HeavyWeight
14,15,Damien Éloi,1969-07-04,Vire,Calvados,FRA,France,165.0,58.0,NaN,average,LightWeight
15,16,Adrien Fauchier-Magnan,1873-11-19,Paris VIIIe,Paris,FRA,France,NaN,NaN,1965-08-06,Tall,HeavyWeight
16,17,Guy Forget,1965-01-04,Casablanca,Casablanca-Settat,MAR,France,189.0,79.0,NaN,Tall,HeightWeight
17,18,Jean-Philippe Gatien,1968-10-16,Alès,Gard,FRA,France,178.0,73.0,NaN,average,HeightWeight
18,19,Maurice Germot,1882-11-15,Vichy,Allier,FRA,France,NaN,NaN,1958-08-06,Tall,HeavyWeight
19,20,André Gobert,1890-09-30,Paris XVIIe,Paris,FRA,France,NaN,NaN,1951-12-06,Tall,HeavyWeight